{
  "story_id": "",
  "memory_mode": "none",
  "language": "en",
  "title": "",
  "chapters": [
    { "id": 1, "text": "Jake stood frozen at the doorway of the robotics club, clutching his backpack straps so tightly his knuckles turned white. Twenty pairs of eyes stared back at him. The room buzzed with the sounds of small motors, clicking keyboards, and whispered conversations that stopped the moment he appeared. A tall girl with bright blue hair approached. \"You lost?\" she asked with a smirk that made the others snicker. Jake had transferred schools three times in two years, and making friends never got easier. His mom promised this school would be different. The robotics club seemed perfect—he loved building things and these could be his people. But the girl's tone made his stomach sink. Then a boy in the corner waved him over. \"Ignore Mia. She acts tough but she needs help with her code. Can you program?\" Jake took a deep breath and stepped inside." },
    { "id": 2, "text": "Jake took a deep breath and stepped inside. The robotics club room buzzed with activity as students huddled around tables covered with wires, circuit boards, and half-built machines. He clutched his backpack tightly, scanning the unfamiliar faces. The club teacher, Mr. Wilson, noticed Jake standing awkwardly by the door and waved him over with a friendly smile. \"Everyone, this is Jake, our newest member,\" Mr. Wilson announced. The other students looked up briefly before returning to their projects. Jake shuffled toward an empty seat next to a girl with bright blue hair who was programming a small wheeled robot. \"I'm Zoe,\" she said, not looking up from her computer screen. \"You can help me test this navigation code if you want.\" Jake nodded, setting down his backpack and pulling up a chair, his nervousness beginning to fade as he watched the little robot spin in circles." },
    { "id": 3, "text": "Jake leaned forward to get a better look at the robot's flashing lights and spinning wheels. The other kids in the robotics club gathered around, introducing themselves one by one. Ms. Peterson, the club advisor, handed Jake a small controller with colorful buttons. \"Why don't you give it a try?\" she suggested with a smile. Jake carefully pressed the green button, and the robot stopped spinning, then moved forward in a straight line. Everyone clapped, making Jake's cheeks turn pink. A tall boy named Theo showed Jake how to program simple commands into the robot using a laptop. By the end of the meeting, Jake had made the robot dance, pick up a small block, and even say his name in a funny robotic voice. When the bell rang, Jake realized he hadn't checked his phone once - he'd been having too much fun." },
    { "id": 4, "text": "Jake grabbed his backpack and headed out of the classroom, still thinking about the robot he'd been building in Robotics Club. It was his first day there, and he'd already made friends with Mia and Tyler, who showed him how to connect the wires correctly. The three of them had worked together to program their robot to move in a square pattern, and Jake couldn't believe it when their creation actually followed their commands. Mr. Wilson, the club teacher, had even complimented their teamwork. As Jake walked down the hallway, he spotted Mia waving at him near the water fountain. \"Same time tomorrow?\" she called out. Jake nodded enthusiastically, already looking forward to tomorrow's club meeting where they planned to add a sensor to their robot. For once, he wasn't in a rush to get home and play video games." },
    { "id": 5, "text": "For once, he wasn't in a rush to get home and play video games. Instead, Marcus lingered in the school hallway, staring at the colorful flyer for the robotics club. The meeting started in ten minutes in room 203, and something about building machines pulled at him. Marcus walked slowly to the classroom, peeking through the door window first. Five students sat around tables covered with metal parts, wires, and tools. A tall teacher with wild gray hair waved him in with a smile. \"Welcome! Grab a seat,\" she said, handing him a small motor and some wires. The other kids looked up briefly, then returned to their projects. A girl with a blue streak in her hair showed Marcus how to connect the wires to make the motor spin. His fingers fumbled at first, but when the motor finally whirred to life, Marcus felt prouder than beating any video game level." },
    { "id": 6, "text": "Marcus grinned as his robot rolled across the table, catching the attention of other Robotics Club members. Mrs. Chen, the club advisor, walked over and nodded with approval. \"Nice work for your first day,\" she said, adjusting her glasses. The other students gathered around to see his creation, a simple wheeled robot that could follow a line drawn on paper. Tanya, the club president, showed Marcus how to add a light sensor that would make his robot even better. When the bell rang, Marcus carefully placed his robot in the storage cabinet with his name taped to the shelf. As he packed his backpack, Tanya invited him to sit with the robotics team at lunch tomorrow. Walking home, Marcus couldn't wait to tell his parents about his successful first day and all the cool things he would build next." },
    { "id": 7, "text": "Marcus hurried along the sidewalk, his backpack bouncing with each excited step. The robotics club meeting had been amazing - he had successfully programmed a small robot to follow a line across the floor while the other kids cheered him on. Even Mr. Wilson, the club teacher, seemed impressed by how quickly Marcus had learned the coding basics. As he turned onto his street, Marcus spotted his mom's car in the driveway and picked up his pace. He burst through the front door, words tumbling out about circuits, motors, and the competition coming up next month. His parents smiled as they listened to his animated description of the robot he planned to build - one that could solve simple mazes. That night, Marcus fell asleep with engineering diagrams dancing in his head, knowing he had finally found where he belonged." }
  ]
}