{
  "story_id": "",
  "memory_mode": "none",
  "language": "en",
  "title": "",
  "chapters": [
    { "id": 1, "text": "\"Hey, you're in the wrong room,\" said Mia, barely looking up from the circuit board she was soldering. Jake froze in the doorway of the robotics club, his lunch box clutched tightly in his sweaty hand. The five other students hunched over various mechanical parts didn't even bother to acknowledge him. He had spent three weeks at this new school trying to be invisible, but Ms. Peterson had suggested he join a club to make friends. Robotics seemed perfect - he could build things quietly without much talking. \"Actually, I signed up yesterday,\" Jake said, his voice cracking. Mia raised an eyebrow and exchanged glances with a boy wearing thick glasses. \"Whatever. Just don't touch my tools.\" Jake nodded and took a seat at the empty table. Little did he know that in this room full of misfits, he'd find his people - if they didn't kick him out first." },
    { "id": 2, "text": "Jared stood at the doorway of the robotics club, his new backpack heavy on his shoulders. The room buzzed with activity - kids hunched over circuit boards, others arguing about code, and a small robot zooming across the floor. He took a deep breath and stepped inside, accidentally knocking over a stack of plastic bins. Everyone turned to stare at him. \"Sorry,\" Jared mumbled, his face burning hot. A tall girl with purple hair walked over and helped him pick up the mess. \"I'm Zoe, club president,\" she said. \"You know anything about robots?\" Jared shook his head. \"Not really, but I want to learn.\" Some of the other kids snickered. Zoe shot them a look. \"Everyone starts somewhere. We need someone to test our maze-runner bot. Think you can handle that?\" Jared nodded eagerly, relief washing over him. Maybe this wouldn't be so bad after all." },
    { "id": 3, "text": "Zack looked around the robotics club room nervously. The tables were covered with circuit boards, wires, and tools he didn't recognize. Other students worked in small groups, laughing and talking as they built their robots. A tall girl with curly hair noticed him standing alone and waved him over. \"I'm Maya,\" she said, showing him the small robot she was working on. \"Want to help?\" Zack nodded and sat down beside her. Maya handed him some wires and explained how to connect them to the battery. When their robot finally moved across the table, Zack couldn't help but smile. Maya high-fived him and introduced him to the other club members. They all wore matching team shirts with a robot logo. The teacher announced a competition next month, and Maya asked Zack to be her partner. Maybe this wouldn't be so bad after all." },
    { "id": 4, "text": "Kai stood nervously at the door of the robotics club, watching the other students work on their projects. He had just moved to this school last week and hadn't made any friends yet. Ms. Rodriguez, the club advisor, noticed him and waved him over with a smile. \"Everyone, this is Kai, our newest member!\" she announced. The other students looked up from their work tables covered with wires, circuit boards, and tiny motors. A girl with curly hair named Mia showed Kai to an empty seat at her table and handed him a small robot that needed fixing. \"The servo motor is stuck,\" she explained, pointing to a broken joint. Kai carefully examined the robot, remembering how he used to fix his dad's old electronics back home. His fingers worked quickly, reconnecting a loose wire that others had missed. When the robot suddenly beeped and moved its arm, everyone cheered. Maybe this wouldn't be so bad after all." },
    { "id": 5, "text": "Jamie walked into the robotics club room, looking around nervously at the tables covered with wires, circuit boards, and half-built machines. A friendly girl with curly hair waved him over to an empty seat. \"I'm Zoe,\" she said, handing him a small motor and some gears. \"We're building maze-solving robots today.\" Jamie smiled as he examined the parts. The teacher, Mr. Wilson, came by and showed him how to connect the wires to the battery pack. When Jamie's robot successfully moved forward for the first time, everyone cheered. Zoe helped him attach wheels and sensors, explaining each step patiently. By the end of the meeting, Jamie's robot could follow a black line across the table. As everyone packed up, Zoe invited him to sit with her group at lunch tomorrow. Jamie nodded eagerly, already looking forward to the next club meeting." },
    { "id": 6, "text": "The following week, Jamie arrived at the robotics club early, carrying a small toolbox his dad had given him. The classroom buzzed with activity as other students worked on their projects. Mr. Chen, the club advisor, waved Jamie over to a table where three other kids were assembling what looked like a small rover. \"This is our competition team,\" Mr. Chen explained. \"They could use your help with the programming.\" A girl with curly hair introduced herself as Zoe and showed Jamie their project notebook. Jamie's fingers trembled slightly as he typed his first lines of code into the team's laptop. When the rover successfully moved forward and turned in a perfect circle, everyone cheered. \"We might actually have a chance at regionals now,\" Zoe said, giving Jamie a high-five. For the first time since moving to this new school, Jamie felt like he belonged." },
    { "id": 7, "text": "Jamie watched as the other students in the robotics club worked on their projects, feeling nervous but excited. The club president, a tall girl named Mia, showed Jamie how to connect wires to the small robot they were building. Jamie's fingers trembled at first, but after a few tries, the connections worked perfectly. The robot rolled forward across the table, blinking its tiny lights. Everyone cheered, patting Jamie on the back. Over the next few weeks, Jamie learned more about coding and mechanics, helping the team prepare for the upcoming competition. When the big day arrived, their robot completed all the challenges, winning second place. As they celebrated with pizza after school, Jamie smiled, looking around at these new friends. This wasn't just about robots—it was about finding people who understood. Jamie finally had a place to call home." }
  ]
}